require './linear'

a = [1, 2, 3, 5, 8]
p polynomial(a)  # [1, -1, -1]

# 途中からフィボナッチ
a = [1, 2, 3, 4, 5, 8, 13, 21, 34, 55, 89, 144]
p polynomial(a)  # [1, -1, -1, 0, 0, 0, 0] 0が4つあるので1,2,3,4を除けば線形

# 途中からフィボナッチ
a = [1, 2, 3, 4, 5, 6, 7, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597, 2584, 4181, 6765, 10946, 17711, 28657, 46368, 75025, 121393, 196418]
f = polynomial(a)
p f  # [1, -1, -1, 0, 0, 0, 0, 0, 0, 0] 0が7つあるので1,2,3,4,5,6,7を除けば線形
p reccurence_form(f)      # a(n) = a(n-1) + a(n-2)
p reccurence_relation(a)  # a(n) = a(n-1) + a(n-2)
